; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v12 ?v2)
             (pred_3 ?v8 ?v1)
             (pred_10 ?v12 ?v1)
             (pred_7 ?v5 ?v12 )
	     (pred_4 ?v12)
             (pred_5 ?v4)
             (pred_8 ?v8)
             (pred_6 ?v1)
             (pred_2 ?v12)
             (pred_1 ?v8)
             (pred_9 ?v12)
             (pred_12 ))



(:action op_2
:parameters (?v7 ?v10 ?v13 ?v3)
:precondition (and (pred_5 ?v7) (pred_5 ?v10) (pred_8 ?v13) (pred_6 ?v3)
          (pred_11 ?v7 ?v10) (pred_3 ?v13 ?v3)
                   (pred_10 ?v10 ?v3) (pred_4 ?v7) 
                   (pred_2 ?v10) (pred_1 ?v13))
:effect (and  (pred_9 ?v10) (not (pred_2 ?v10))))


(:action op_3
:parameters (?v7 ?v11)
:precondition (and (pred_5 ?v7) (pred_5 ?v11)
               (pred_4 ?v7) (pred_11 ?v7 ?v11) (pred_9 ?v11))
:effect (and (pred_4 ?v11) (not (pred_4 ?v7))))

(:action op_5
:parameters (?v7 ?v13)
:precondition (and (pred_5 ?v7) (pred_8 ?v13) 
                  (pred_4 ?v7) (pred_7 ?v13 ?v7) (pred_12 ))
:effect (and (pred_1 ?v13)
   (not (pred_7 ?v13 ?v7)) (not (pred_12 ))))


(:action op_4
:parameters (?v7 ?v6 ?v9)
:precondition (and (pred_5 ?v7) (pred_8 ?v6) (pred_8 ?v9)
                  (pred_4 ?v7) (pred_1 ?v9) (pred_7 ?v6 ?v7))
:effect (and (pred_1 ?v6) (pred_7 ?v9 ?v7)
        (not (pred_1 ?v9)) (not (pred_7 ?v6 ?v7))))

(:action op_1
:parameters (?v7 ?v13)
:precondition (and (pred_5 ?v7) (pred_8 ?v13) 
                  (pred_4 ?v7) (pred_1 ?v13))
:effect (and (pred_12 ) (pred_7 ?v13 ?v7) (not (pred_1 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_04 obj_25 obj_23 obj_12 obj_22 obj_29 obj_03 obj_20 obj_16 obj_06 obj_13 obj_08 obj_15 obj_05 obj_18 obj_19 obj_26 obj_17 obj_24 obj_01 obj_11 obj_07 obj_10 obj_21
    obj_30 obj_27
    obj_28 obj_09 obj_02
    )

    (:init
       (pred_12)

       (pred_5 obj_14)
       (pred_5 obj_04)
       (pred_5 obj_25)
       (pred_5 obj_23)
       (pred_5 obj_12)
       (pred_5 obj_22)
       (pred_5 obj_29)
       (pred_5 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_16)
       (pred_5 obj_06)
       (pred_5 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_15)
       (pred_5 obj_05)
       (pred_5 obj_18)
       (pred_5 obj_19)
       (pred_5 obj_26)
       (pred_5 obj_17)
       (pred_5 obj_24)
       (pred_5 obj_01)
       (pred_5 obj_11)
       (pred_5 obj_07)
       (pred_5 obj_10)
       (pred_5 obj_21)
       (pred_6 obj_30)
       (pred_6 obj_27)
       (pred_8 obj_28)
       (pred_8 obj_09)
       (pred_8 obj_02)

       (pred_11 obj_14 obj_22)
       (pred_11 obj_14 obj_04)
       (pred_11 obj_04 obj_29)
       (pred_11 obj_04 obj_25)
       (pred_11 obj_04 obj_14)
       (pred_11 obj_25 obj_03)
       (pred_11 obj_25 obj_23)
       (pred_11 obj_25 obj_04)
       (pred_11 obj_23 obj_20)
       (pred_11 obj_23 obj_12)
       (pred_11 obj_23 obj_25)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_23)
       (pred_11 obj_22 obj_06)
       (pred_11 obj_22 obj_29)
       (pred_11 obj_22 obj_14)
       (pred_11 obj_29 obj_13)
       (pred_11 obj_29 obj_03)
       (pred_11 obj_29 obj_04)
       (pred_11 obj_29 obj_22)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_25)
       (pred_11 obj_03 obj_29)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_16)
       (pred_11 obj_20 obj_23)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_16 obj_20)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_22)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_08)
       (pred_11 obj_13 obj_29)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_13)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_05 obj_24)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_18 obj_01)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_06)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_19 obj_26)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_26 obj_07)
       (pred_11 obj_26 obj_17)
       (pred_11 obj_26 obj_08)
       (pred_11 obj_26 obj_19)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_17 obj_24)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_17 obj_26)
       (pred_11 obj_24 obj_21)
       (pred_11 obj_24 obj_05)
       (pred_11 obj_24 obj_17)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_18)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_11 obj_19)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_26)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_10 obj_21)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_21 obj_24)
       (pred_11 obj_21 obj_10)
       (pred_2 obj_01)
       (pred_2 obj_07)
       (pred_2 obj_13)
       (pred_10  obj_01 obj_30)
       (pred_10  obj_07 obj_27)
       (pred_10  obj_13 obj_30)
       (pred_9 obj_14)
       (pred_9 obj_04)
       (pred_9 obj_25)
       (pred_9 obj_23)
       (pred_9 obj_12)
       (pred_9 obj_22)
       (pred_9 obj_29)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_08)
       (pred_9 obj_15)
       (pred_9 obj_05)
       (pred_9 obj_18)
       (pred_9 obj_19)
       (pred_9 obj_26)
       (pred_9 obj_17)
       (pred_9 obj_24)
       (pred_9 obj_11)
       (pred_9 obj_10)
       (pred_9 obj_21)

       (pred_3  obj_28 obj_30)
       (pred_3  obj_09 obj_27)
       (pred_3  obj_02 obj_30)
       (pred_7 obj_28 obj_23)
       (pred_7 obj_09 obj_23)
       (pred_7 obj_02 obj_26)
       (pred_4 obj_04)
    )

    (:goal (and
       (pred_7 obj_02 obj_18)
    ))
(:constraints
  (always (not (pred_4 obj_19)))
)
)

; plan
1. (op_3 obj_04 obj_29)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_29)
   goals met: 0 of 1
2. (op_3 obj_29 obj_03)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_03)
   goals met: 0 of 1
3. (op_3 obj_03 obj_08)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_08)
   goals met: 0 of 1
4. (op_3 obj_08 obj_26)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_26)
   goals met: 0 of 1
5. (op_5 obj_26 obj_02)
   deleted: (pred_7 obj_02 obj_26) (pred_12)
   added: (pred_1 obj_02)
   goals met: 0 of 1
6. (op_3 obj_26 obj_08)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_08)
   goals met: 0 of 1
7. (op_2 obj_08 obj_13 obj_02 obj_30)
   deleted: (pred_2 obj_13)
   added: (pred_9 obj_13)
   goals met: 0 of 1
8. (op_3 obj_08 obj_13)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_13)
   goals met: 0 of 1
9. (op_3 obj_13 obj_06)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_06)
   goals met: 0 of 1
10. (op_3 obj_06 obj_18)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_18)
   goals met: 0 of 1
11. (op_1 obj_18 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_12) (pred_7 obj_02 obj_18)
   goals met: 1 of 1
